rails/app/controllers/posts_controller.rb

  def index
    @posts = Posts.find :all
---
SELECT * FROM "posts"